In [1]:
import pandas as pd
import numpy as np

In [2]:
df1 = pd.DataFrame(np.random.randn(9).reshape(3,3),index=pd.date_range('20181105',periods=3,freq='3H'),columns=['BJ','SH','GZ'])

In [3]:
df1

                           BJ        SH        GZ
2018-11-05 00:00:00  0.034685 -0.089718 -2.104602
2018-11-05 03:00:00 -0.532919 -0.765455  1.219429
2018-11-05 06:00:00  0.484831  1.547411  1.512637

In [4]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 3 entries, 2018-11-05 00:00:00 to 2018-11-05 06:00:00
Freq: 3H
Data columns (total 3 columns):
BJ    3 non-null float64
SH    3 non-null float64
GZ    3 non-null float64
dtypes: float64(3)
memory usage: 96.0 bytes

In [5]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 3 entries, 2018-11-05 00:00:00 to 2018-11-05 06:00:00
Freq: 3H
Data columns (total 3 columns):
BJ    3 non-null float64
SH    3 non-null float64
GZ    3 non-null float64
dtypes: float64(3)
memory usage: 96.0 bytes

# 重命名

In [6]:
df1.columns=['bj','sh','gz']
df1

                           bj        sh        gz
2018-11-05 00:00:00  0.034685 -0.089718 -2.104602
2018-11-05 03:00:00 -0.532919 -0.765455  1.219429
2018-11-05 06:00:00  0.484831  1.547411  1.512637

In [7]:
df1.index=['a','b','c']
df1

         bj        sh        gz
a  0.034685 -0.089718 -2.104602
b -0.532919 -0.765455  1.219429
c  0.484831  1.547411  1.512637

In [8]:
df1.index = df1.index.map({'a':'A','b':"B",'c':'as'})
df1

          bj        sh        gz
A   0.034685 -0.089718 -2.104602
B  -0.532919 -0.765455  1.219429
as  0.484831  1.547411  1.512637

In [9]:
df1

          bj        sh        gz
A   0.034685 -0.089718 -2.104602
B  -0.532919 -0.765455  1.219429
as  0.484831  1.547411  1.512637

In [10]:
df1.index.map(str.upper)

Index(['A', 'B', 'AS'], dtype='object')

In [11]:
df1

          bj        sh        gz
A   0.034685 -0.089718 -2.104602
B  -0.532919 -0.765455  1.219429
as  0.484831  1.547411  1.512637

In [12]:
df1.rename(index=str.lower,columns=str.upper)

          BJ        SH        GZ
a   0.034685 -0.089718 -2.104602
b  -0.532919 -0.765455  1.219429
as  0.484831  1.547411  1.512637

In [13]:
df1

          bj        sh        gz
A   0.034685 -0.089718 -2.104602
B  -0.532919 -0.765455  1.219429
as  0.484831  1.547411  1.512637

In [14]:
df1.rename(index={'A':'QWER'},columns={'bj':'BJ'})

            BJ        sh        gz
QWER  0.034685 -0.089718 -2.104602
B    -0.532919 -0.765455  1.219429
as    0.484831  1.547411  1.512637

In [15]:
df1

          bj        sh        gz
A   0.034685 -0.089718 -2.104602
B  -0.532919 -0.765455  1.219429
as  0.484831  1.547411  1.512637